UAS Kelompok 8/tanyaft/app/Controllers/TanyaFT.php

    public function main()
    {
        $data['pengajuan'] = $this->pengajuanModel->findAll();
---
SELECT *
FROM `pengajuan`

    public function detailPengajuan($id)
    {
        // Mengambil data pengajuan berdasarkan ID
        $data['pengajuan'] = $this->pengajuanModel->find($id);
---
SELECT *
FROM `pengajuan`
WHERE `pengajuan`.`id` = '11'

function sanitizeFileName($fileName) {
    // Replace spaces and disallowed characters with underscores
    return preg_replace('/[^a-zA-Z0-9\-_\.]/', '_', $fileName);
}

    // Handle file upload
    $file = $this->request->getFile('bukti_dukung');
    if ($file->isValid() && !$file->hasMoved()) {
        // Get the original name and sanitize it
        $originalName = $file->getClientName();
        $sanitizedFileName = sanitizeFileName($originalName);

        // Move the file to the public/uploads directory with the sanitized name
        $file->move(FCPATH . 'uploads', $sanitizedFileName);

        // Save data to the database with the relative file path
        $data = [
            'nama' => $this->request->getPost('nama'),
            'nim' => $this->request->getPost('nim'),
            'program_studi' => $this->request->getPost('program_studi'),
            'pertanyaan' => $this->request->getPost('pertanyaan'),
            'bukti_dukung' => 'uploads/' . $sanitizedFileName, // Save the relative path
        ];

        // Assume you have a model called 'PengajuanModel' to handle database operations
        $this->pengajuanModel->insert($data);
---
INSERT INTO `pengajuan` (`nama`, `nim`, `program_studi`, `pertanyaan`, `bukti_dukung`, `created_at`, `updated_at`) VALUES ('Ahmad Reza Alfayiet', '2210817210016', 'Teknologi Informasi', 'Apa saja keuntungan layanan FT ULM yang baru dibuat ini?', 'uploads/default_image.png', '2024-07-02 08:13:22', '2024-07-02 08:13:22')